import { LatLngExpression } from 'leaflet'
type districsName =
  '中正區' |
  '大同區' |
  '中山區' |
  '松山區' |
  '大安區' |
  '萬華區' |
  '信義區' |
  '士林區' |
  '北投區' |
  '內湖區' |
  '南港區' |
  '文山區' |
  '臺大專區'

export let districs: districsName[] = [
  '中正區',
  '大同區',
  '中山區',
  '松山區',
  '大安區',
  '萬華區',
  '信義區',
  '士林區',
  '北投區',
  '內湖區',
  '南港區',
  '文山區',
  '臺大專區'
]
export const districtLatLanMap =
  new Map<districsName, LatLngExpression>([
    ['大安區', [25.02605, 121.5436]],
    ['大同區', [25.07717, 121.50934]],
    ['士林區', [25.08128, 121.51784]],
    ['文山區', [24.99898, 121.5403]],
    ['中正區', [25.0255, 121.52346]],
    ['中山區', [25.07805, 121.5295]],
    ['內湖區', [25.09122, 121.55961]],
    ['北投區', [25.12416, 121.52607]],
    ['松山區', [25.062, 121.54472]],
    ['南港區', [25.04608, 121.58315]],
    ['信義區', [25.03599, 121.56218]],
    ['萬華區', [25.01975, 121.4973]],
    ['臺大專區', [25.01666, 121.53718]],
  ])